package Java_Basics;

public class C14_IO_stream {

    /*
     * Java将数据的输入输出（I/O） 操作当作“流”来处理
     * “流”是一组有序的数据序列
     * “流”分为两种形式:
        * 输入流 - 从数据源中读取数据是输入流
            * 输入形式如文件, 网络和键盘等, 键盘是默认的标准输入设备。
        * 输出流 - 将数据写入到目的地是输出流
            * 数据输出的目的地也有多种形式, 如文件, 网络和控制台, 控制台(console)是默认的标准输出设备
     * 所有的输入形式都抽象为输入流， 所有的输出形式都抽象为输出流， 它们与设备无关

     * 以字节为单位的流称为字节流， 以字符为单位的流称为字符流。
     * Java SE提供4个顶级抽象类:
        * 两个字节流抽象类:
            * InputStream
            * OutputStream
        * 两个字符流抽象类
            * Reader
            * Writer
     */

}





